{
  "specialities": ["software", "embedded", "digital", "web"],
  "specialOrderProj": ["embedded", "software", "digital", "web"],
  "specialOrderCourse": ["embedded", "software", "digital"],
  "header": {
    "name": "SALAH-ELDIN HASSEN",
    "contact": "salah1423161@gmail.com - Giza / Egypt - (+20) 1127709232",
    "links": "https://www.linkedin.com/in/salah-eldin-hassen-5bba10250/ - https://github.com/salah0eldin"
  },
  "summary": [
    "Dynamic and adaptable Software Engineer with extensive experience across embedded, digital, and web technologies. Proficient in C/C++ and Python, I excel at leveraging advanced AI tools to transform innovative ideas into robust, production-ready solutions. A fast learner and effective collaborator, I bring a creative, forward-thinking approach to solving complex technical challenges."
  ],
  "education": [
    "Cairo University Faculty of Engineering, Department of Electronics and Electrical Communication Engineering (CUFE EECE), Maintaining a (Very Good) degree // 2021 - 2026."
  ],
  "work_experience": [
    {
      "header": "Robotics & Embedded Instructor // Beta Academy // Seasonal // Jan 2023 - Present.",
      "body": "Promoted from Technical Support to Lead Instructor for Arduino and AVR embedded systems, instructing 600+ students in programming and hardware integration with consistently positive feedback."
    },
    {
      "header": "Coding AI Trainer // Outlier // Freelancing // Nov 2024 - Dec 2024.",
      "body": "Trained and optimized AI models for coding tasks through iterative evaluation, scenario-based testing, and targeted training frameworks to enhance code generation accuracy and algorithmic proficiency."
    },
    {
      "header": "Data Entry Clerk // Covo Connect // Full time // Jun 2023 - Jul 2023.",
      "body": "Entering banking data from photos to text, improving touch-typing skills."
    }
  ],
  "skills": {
    "software": [
      "C / C++",
      "OOP",
      "MATLAB",
      "Assembly",
      "Rust",
      "Data Structures",
      "Algorithms",
      "Python",
      "Automation",
      "Scripting",
      "Kali Nethunter",
      "Ubuntu",
      "Debian",
      "AI tools",
      "Qt",
      "Git & Git-Hub",
      "Latex."
    ],
    "embedded": [
      "Atmega16/32 (AVR)",
      "PIC18F2XK20/4XK20 (PIC)",
      "STM32",
      "ARM Cortex-M",
      "Embedded C",
      "FreeRTOS",
      "I2C",
      "USART",
      "SPI",
      "SOMEIP."
    ],
    "digital": [
      "HDL languages (VHDL, Verilog, System Verilog).",
      "FPGA Xilnix",
      "Linting"
    ],
    "web": [
      "HTML5",
      "CSS3",
      "JavaScript",
      "Bootstrap",
      "jQuery",
      "Laravel",
      "SQL."
    ]
  },
  "tools": [
    "Visual Studio",
    "Eclipse",
    "Cube IDE",
    "MPLAB Code Configurator",
    "MATLAB",
    "Proteus",
    "Cadence",
    "Multisim",
    "Questa/Modelsim",
    "Vivado",
    "Arduino IDE",
    "QT Creator",
    "DataGrip",
    "Altium"
  ],
  "projects": {
    "embedded": [
      {
        "title": "FreeRTOS-Based Dual Microcontroller Door Security System",
        "main": {
          "description": "Developed a door security system using two microcontrollers with FreeRTOS for efficient task management, Implemented password authentication, I2C-based EEPROM storage, and automated door mechanisms to enhance access control. Integrated PIR sensors for motion detection and an H-bridge for motor control.",
          "key_elements": [
            "ATMega32",
            "I2C",
            "USART",
            "EEPROM",
            "FreeRTOS",
            "Semaphores",
            "Queue",
            "PIR sensor",
            "H-bridge."
          ]
        },
        "shortend": {
          "description": "Designed a dual-microcontroller-based door security system with FreeRTOS, password authentication, and automated mechanisms. Utilized I2C EEPROM storage and motion detection for enhanced access control.",
          "key_elements": [
            "ATMega32",
            "I2C",
            "USART",
            "EEPROM",
            "FreeRTOS",
            "PIR sensor",
            "H-bridge."
          ]
        }
      },
      {
        "title": "Advanced Digital Multimeter on PCB",
        "main": {
          "description": "Developed a digital multimeter capable of measuring voltage (-200V to 200V), current (0.5mA to 2A), and resistance (0Ω to 5MΩ). Designed the circuit from scratch and implemented it on a custom PCB. Integrated an LCD and keypad for user input, with ADC, relays, MUX, and DEMUX for signal processing.",
          "key_elements": [
            "ATMega32",
            "PCB",
            "GPIO",
            "LCD",
            "Keypad",
            "ADC",
            "Relays",
            "MUX",
            "DEMUX."
          ]
        },
        "shortend": {
          "description": "Designed a PCB-based multimeter to measure voltage, current, and resistance, integrating an LCD, keypad, and ADC for signal processing.",
          "key_elements": [
            "ATMega32",
            "PCB",
            "GPIO",
            "LCD",
            "Keypad",
            "ADC",
            "Relays",
            "MUX",
            "DEMUX."
          ]
        }
      },
      {
        "title": "I2C-Integrated Control Unit",
        "main": {
          "description": "Designed a control unit to monitor temperature and control a motor using multiple I2C devices, including a temperature sensor, RTC, external EEPROM, and a slave MCU. Developed firmware using MCC for seamless I2C communication.",
          "key_elements": [
            "PIC18F46K20",
            "MCC (MPLAB Code Configurator)",
            "I2C",
            "USART",
            "RTC",
            "EEPROM."
          ]
        },
        "shortend": {
          "description": "Developed an I2C-based control unit for temperature monitoring and motor control, integrating RTC, EEPROM, and a slave MCU.",
          "key_elements": ["PIC18F46K20", "I2C", "USART", "RTC", "EEPROM."]
        }
      }
    ],
    "software": [
      {
        "title": "Concurrent Rust TCP Server with Test Suite Optimization",
        "main": {
          "description": "Developed a multithreaded TCP server in Rust, transitioning from a buggy single-threaded implementation. Improved client handling using Protocol Buffers for structured communication. Optimized the test suite by resolving port conflicts through port isolation and serial execution strategies.",
          "key_elements": [
            "Rust",
            "Multithreading",
            "Protocol Buffers",
            "Thread Safety",
            "Non-blocking I/O."
          ]
        },
        "shortend": {
          "description": "Designed a multithreaded Rust TCP server with Protocol Buffers and optimized test suite for port conflict resolution.",
          "key_elements": [
            "Rust",
            "Multithreading",
            "Protocol Buffers",
            "Thread Safety",
            "Non-blocking I/O."
          ]
        }
      },
      {
        "title": "Advanced Tic Tac Toe Game",
        "main": {
          "description": "Developed a C++ Tic Tac Toe game featuring user authentication, personalized game history, and AI-driven gameplay using the minimax algorithm. Implemented an interactive GUI with Qt, secure user management with hashing, and performance optimizations. Automated testing was conducted using Qt Test on Github Actions.",
          "key_elements": [
            "C++",
            "Minimax Algorithm",
            "Secure Hashing",
            "Qt",
            "Qt Test",
            "SQLite",
            "Git",
            "GitHub Actions."
          ]
        },
        "shortend": {
          "description": "Designed a C++ Tic Tac Toe game with AI (minimax), secure user authentication, and an interactive Qt-based GUI.",
          "key_elements": [
            "C++",
            "Minimax Algorithm",
            "Secure Hashing",
            "Qt",
            "SQLite",
            "Git",
            "GitHub Actions."
          ]
        }
      },
      {
        "title": "Advanced Image Editor with Qt and OpenCV",
        "main": {
          "description": "Built a C++ image editor using Qt and OpenCV, supporting cropping, resizing, and various filters (blur, grayscale, sharpen). Designed a dark mode UI with drag-and-drop image loading and real-time editing capabilities.",
          "key_elements": ["C++", "OpenCV", "Qt."]
        },
        "shortend": {
          "description": "Developed a Qt-based C++ image editor with OpenCV, featuring cropping, resizing, filters, and real-time editing.",
          "key_elements": ["C++", "OpenCV", "Qt."]
        }
      }
    ],
    "digital": [
      {
        "title": "SPI Slave Interface",
        "main": {
          "description": "Designed and implemented an SPI Slave Interface with two variations: an optimized FSM-based version and a required design integrating a debug core. The project includes Verilog design files, test benches, simulation results, lint reports, and constraints.",
          "key_elements": [
            "Vivado",
            "Questasim",
            "Verilog",
            "SPI",
            "Single-Port RAM",
            "Constraints",
            "Linting."
          ]
        },
        "shortend": {
          "description": "Developed an SPI Slave Interface with optimized FSM and debug core integration, including simulation and constraints.",
          "key_elements": [
            "Verilog",
            "SPI",
            "FSM Design",
            "Simulation",
            "Linting."
          ]
        }
      },
      {
        "title": "Spartan-6 DSP48A1",
        "main": {
          "description": "Developed a DSP48A1 block, a crucial component in digital signal processing. Designed in Verilog and tested using C++ (Created golden modle) and Verilog test benches. The project includes simulation results, lint reports, and automation scripts for verification.",
          "key_elements": [
            "Verilog",
            "DSP48A1",
            "Digital Signal Processing",
            "C++ Simulation",
            "Test Benches",
            "Linting."
          ]
        },
        "shortend": {
          "description": "Designed and tested a DSP48A1 digital signal processing block in Verilog with C++ test benches and simulations.",
          "key_elements": [
            "Verilog",
            "DSP48A1",
            "C++ Simulation",
            "Test Benches",
            "Linting."
          ]
        }
      }
    ],
    "web": [
      {
        "title": "Laravel Workshops System",
        "main": {
          "description": "Developed a Laravel-based system for managing workshop sessions, enabling creation, scheduling, participant registration, and attendance tracking. Implemented a responsive UI with Bootstrap and ensured data integrity with MySQL.",
          "key_elements": ["Laravel", "PHP", "MySQL", "Bootstrap", "Git."]
        },
        "shortend": {
          "description": "Built a Laravel system for workshop scheduling, participant management, and attendance tracking.",
          "key_elements": ["Laravel", "PHP", "MySQL", "Bootstrap", "Git."]
        }
      }
    ]
  },
  "other_projects": [
    "Multi-CV Generator Script - Automated Multi-CV generation using Python for ATS-friendly resume formatting.",
    "Simulation & Linting Scripts - Developed Python and batch sc,ripts for running ModelSim simulations, waveform viewing (GTKWave), and linting Verilog files using Qverify.",
    "Maze-Solving Line-Follower Robot Car - Arduino-based pathfinding robot.",
    "SFML Chess Game - C++ chess game with an interactive GUI."
  ],
  "courses": {
    "embedded": [
      {
        "title": "Advanced Embedded Diploma // Eng: Ahmed Abdel-Gafar // Dec 2024 - Current.",
        "main_description": [
          "Comprehensive training on ARM Cortex-M4 architecture, debugging, and memory systems.",
          "Embedded systems development covering compilation process, linker script, and startup code.",
          "Device driver development for GPIO, RCC, SysTick Timer, Flash Memory Interface, and NVIC.",
          "Bootloader design, implementation, and testing for embedded applications.",
          "Automotive communication protocols including LIN and CAN.",
          "Introduction to AUTOSAR fundamentals, layered architecture, and modular programming.",
          "Compliance with MISRA C standards for secure and reliable embedded development."
        ],
        "shortend_description": [
          "Comprehensive training on ARM Cortex-M4, embedded development, and device drivers.",
          "Bootloader implementation, automotive protocols (LIN, CAN), and AUTOSAR fundamentals.",
          "MISRA C compliance for secure embedded software development."
        ]
      },
      {
        "title": "Embedded PIC Diploma // Eng: Ahmed Abdel-Gafar // Jul 2024 - Sep 2024.",
        "main_description": [
          "Fundamentals of embedded systems, C programming, and embedded development tools.",
          "PIC microcontroller interfacing with full driver implementation using Embedded C.",
          "Communication protocols including USART, SPI, and I2C."
        ],
        "shortend_description": [
          "Training on embedded systems, PIC microcontrollers, and Embedded C.",
          "Implemented drivers and worked with USART, SPI, and I2C protocols."
        ]
      },
      {
        "title": "Embedded AVR Diploma // Eng: Mohammed Tarek // Jun 2024 - Oct 2024.",
        "main_description": [
          "Fundamentals of embedded systems, C programming, and real-time operating systems (RTOS).",
          "Data structures including linked lists, stacks, and queues, along with software engineering principles.",
          "AVR microcontroller interfacing with full driver implementation using Embedded C.",
          "Hands-on hardware labs for practical embedded systems development."
        ],
        "shortend_description": [
          "Training on embedded systems, RTOS, and AVR microcontroller interfacing.",
          "Implemented drivers, worked with Embedded C, and practiced data structures."
        ]
      }
    ],
    "software": [
      {
        "title": "SOME/IP Workshop // BULLET - Eng/Hazem // OCT 2024 - OCT 2024.",
        "main_description": [
          "Hands-on experience with the SOME/IP protocol through a practical workshop.",
          "Implemented sample client-server communication for networked embedded systems.",
          "Explored service-oriented middleware for automotive and IoT applications."
        ],
        "shortend_description": [
          "Practical workshop on SOME/IP protocol and client-server communication.",
          "Focused on service-oriented middleware for automotive and IoT applications."
        ]
      },
      {
        "title": "Linux Fundamentals // IEEE ASU // Aug 2024 - Sep 2024.",
        "main_description": [
          "Learned Linux file management, shell scripting, and user permissions.",
          "Gained skills in process control, package handling, and filesystem management.",
          "Developed expertise in Linux networking, SSH, and web server setup."
        ],
        "shortend_description": [
          "Covered Linux file management, shell scripting, and system operations.",
          "Learned networking, SSH, and web server setup."
        ]
      }
    ],
    "digital": [
      {
        "title": "Digital Design Diploma // Eng: Kareem Waseem // Jan 2025 - Mar 2025.",
        "main_description": [
          "Gained a solid foundation in Digital and RTL Design using Verilog for synthesis and simulation.",
          "Worked with FPGA design flow, including Vivado, IP catalog, and FPGA-based prototyping challenges.",
          "Learned Static Timing Analysis (STA), clock domain crossing techniques, and low-power design methodologies.",
          "Performed code linting and design rule checks using Questa Lint for quality verification."
        ],
        "shortend_description": [
          "Studied Digital/RTL Design with Verilog and FPGA design flow.",
          "Covered STA, CDC techniques, low-power design concepts, and Questa Lint-based analysis."
        ]
      },
      {
        "title": "Digital Verification Course // IEEE CUFE // Mar 2025 - Current.",
        "main_description": [
          "Gained expertise in simulation-based verification using UVM, UVM structures, sequences, and configuration.",
          "Proficient in QuestaSim for simulation, verification planning, functional coverage, and SystemVerilog assertions.",
          "Studying formal verification techniques, clock domain crossing analysis, and debugging FPGA-based designs."
        ],
        "shortend_description": [
          "Training in UVM-based verification, functional coverage, and SystemVerilog assertions.",
          "Working with QuestaSim, formal verification, and FPGA debugging techniques."
        ]
      }
    ]
  },
  "competitions": "First place in Robotics Competition (2022), ECPC Contestant (2022, 2023), NASA Hackathon participant."
}
